УТ_для_edt/src/DataProcessors/смартПечатьСопроводительныхДокументов/смартПечатьСопроводительныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>смартПечатьСопроводительныхДокументов</name>
  <comment>// смарт:ММ #044 224 137 27.04.2020</comment>
  <attributes>
    <name>НомерОтправления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправления</name>
    <comment>#4418 смарт: Тимофеева 26.09.2025 / Обработка Печать Сопроводительных Документов. Доработка.</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесБрутто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаменаЧего</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Оператор</name>
    <comment>// 27.08.2020</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛицоСПравомПодписи</name>
    <type>
      <types>CatalogRef.ОтветственныеЛицаОрганизаций</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗапчастиКОтправке</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодТНВЭД</name>
      <type>
        <types>CatalogRef.КлассификаторТНВЭД</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесНетто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаявки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаявкаСсылка</name>
      <comment>//смарт:ММ 635 19.10.2021</comment>
      <type>
        <types>DocumentRef.смартЗаявкаНаГарантийныйРемонт</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерОтправления</name>
      <comment>#4418 смарт: Тимофеева 26.09.2025 / Обработка Печать Сопроводительных Документов. Доработка.</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтправления</name>
      <comment>#4418 смарт: Тимофеева 26.09.2025 / Обработка Печать Сопроводительных Документов. Доработка.</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

УТ_для_edt/src/InformationRegisters/смартОписанияДляПретензий/смартОписанияДляПретензий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартОписанияДляПретензий</name>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/AccumulationRegisters/ТоварыОрганизаций/ТоварыОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыОрганизаций</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОформлениюСписания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПоРНПТ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>23</precision>
        <scale>11</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОформлениюСписанияПоРНПТ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>23</precision>
        <scale>11</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>КорАналитикаУчетаНоменклатуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>КорВидЗапасов</name>
    <type>
      <types>CatalogRef.ВидыЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияОтгрузки</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРеализации</name>
    <type>
      <types>DocumentRef.ВнутреннееПотреблениеТоваров</types>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef.ПеремаркировкаТоваровГИСМ</types>
      <types>DocumentRef.МаркировкаТоваровГИСМ</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаАктивовПассивов</name>
    <type>
      <types>Characteristic.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетПартий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Первичное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПартияПроизводства</name>
    <type>
      <types>DocumentRef.СборкаТоваров</types>
    </type>
  </attributes>
  <dimensions>
    <name>АналитикаУчетаНоменклатуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЗапасов</name>
    <type>
      <types>CatalogRef.ВидыЗапасов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерГТД</name>
    <type>
      <types>CatalogRef.НомераГТД</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt/src/Catalogs/КлассификаторБанков/КлассификаторБанков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлассификаторБанков</name>
  <comment>АПК:58</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>КоррСчет</name>
    <comment>Корреспондентский счет банка</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефоны</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДеятельностьПрекращена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СВИФТБИК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Страна</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>МеждународноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГородМеждународный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресМеждународный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БИКРКЦ</name>
    <type>
      <types>CatalogRef.КлассификаторБанков</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннийКодЦБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/DataProcessors/смартПечатьСопроводительныхДокументов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ЗаполнитьТаблицу() Экспорт

	ЗапчастиКОтправке.Очистить();
	
	//++ #3978 смарт: Тимофеева 12.08.2025 / Печать сопроводительных документов. Замена печатных форм
	#Область НеАктуально
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	////++ смарт:ММ 635 19.10.2021 
	//|	смартЗаявкаНаГарантийныйРемонт.Ссылка КАК ЗаявкаСсылка,
	////-- смарт:ММ 19.10.2021
	//|	смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.Номенклатура КАК Номенклатура,
	//|	СУММА(смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.Количество) КАК Количество,
	//|	НоменклатураСпр.КодТНВЭД КАК КодТНВЭД,
	//|	ВЫБОР
	//|		КОГДА НоменклатураСпр.ВесЗнаменатель = 0
	//|			ТОГДА НоменклатураСпр.ВесЧислитель
	//|		ИНАЧЕ НоменклатураСпр.ВесЧислитель / НоменклатураСпр.ВесЗнаменатель
	//|	КОНЕЦ КАК ВесНетто,
	//|	ЕСТЬNULL(смартОписанияДляПретензий.Цена, 0) КАК Цена,
	//|	СУММА(ЕСТЬNULL(смартОписанияДляПретензий.Цена, 0) * смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.Количество) КАК Сумма,
	//|	ЕСТЬNULL(ВЫРАЗИТЬ(смартОписанияДляПретензий.Описание КАК СТРОКА(1000)), """") КАК Описание,
	//|	смартЗаявкаНаГарантийныйРемонт.Номер КАК НомерЗаявки,
	//|	ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 1) КАК Курс,
	//|	ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 1) КАК Кратность,
	//|	ЕСТЬNULL(КурсыВалютСрезПоследнихДоллар.Курс, 1) КАК КурсДоллар,
	//|	ЕСТЬNULL(КурсыВалютСрезПоследнихДоллар.Кратность, 1) КАК КратностьДоллар
	//|ИЗ
	//|	Документ.смартЗаявкаНаГарантийныйРемонт.ЗаполняетсяСпециалистомПоПретензиям КАК смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.смартЗаявкаНаГарантийныйРемонт КАК смартЗаявкаНаГарантийныйРемонт
	//|		ПО смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.Ссылка = смартЗаявкаНаГарантийныйРемонт.Ссылка
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСпр
	//|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.смартОписанияДляПретензий КАК смартОписанияДляПретензий
	//|			ПО НоменклатураСпр.Ссылка = смартОписанияДляПретензий.Номенклатура
	//|		ПО смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.Номенклатура = НоменклатураСпр.Ссылка
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, Валюта = &Валюта) КАК КурсыВалютСрезПоследних
	//|		ПО ИСТИНА
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, Валюта = &ВалютаДоллар) КАК КурсыВалютСрезПоследнихДоллар
	//|		ПО ИСТИНА
	//|ГДЕ
	//|	смартЗаявкаНаГарантийныйРемонт.Статус = &Открыта
	//|	И смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.НомерОтправления = &НомерОтправления
	//// 03.06.2020 - убран отбор по статусу
	////|	И смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.Статус = &Статус
	//|
	//|СГРУППИРОВАТЬ ПО
	////++ смарт:ММ 635 19.10.2021 
	//|	смартЗаявкаНаГарантийныйРемонт.Ссылка,
	////-- смарт:ММ 19.10.2021
	//|	смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.Номенклатура,
	//|	НоменклатураСпр.Наименование,
	//|	НоменклатураСпр.КодТНВЭД,
	//|	ЕСТЬNULL(смартОписанияДляПретензий.Цена, 0),
	//|	ЕСТЬNULL(ВЫРАЗИТЬ(смартОписанияДляПретензий.Описание КАК СТРОКА(1000)), """"),
	//|	ВЫБОР
	//|		КОГДА НоменклатураСпр.ВесЗнаменатель = 0
	//|			ТОГДА НоменклатураСпр.ВесЧислитель
	//|		ИНАЧЕ НоменклатураСпр.ВесЧислитель / НоменклатураСпр.ВесЗнаменатель
	//|	КОНЕЦ,
	//|	смартЗаявкаНаГарантийныйРемонт.Номер,
	//|	КурсыВалютСрезПоследних.Курс,
	//|	КурсыВалютСрезПоследних.Кратность,
	//|	КурсыВалютСрезПоследнихДоллар.Курс,
	//|	КурсыВалютСрезПоследнихДоллар.Кратность
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	НомерЗаявки,
	//|	НоменклатураСпр.Наименование";
	//
	//Запрос.УстановитьПараметр("НомерОтправления", НомерОтправления);
	//Запрос.УстановитьПараметр("Открыта", Перечисления.СтатусыКассовойСмены.Открыта);
	//// 03.06.2020 - убран отбор по статусу
	////Запрос.УстановитьПараметр("Статус", Перечисления.смартСтатусыПоГарантии.ОжидаетсяОтправка);
	//
	//ВалютаДоллар = Справочники.Валюты.НайтиПоКоду("840");
	//Запрос.УстановитьПараметр("ВалютаДоллар", ВалютаДоллар);
	//Запрос.УстановитьПараметр("Валюта", Валюта);
	//Запрос.УстановитьПараметр("Дата", Дата);
	//
	//Если Валюта = ВалютаДоллар Тогда
	//	ЗапчастиКОтправке.Загрузить(Запрос.Выполнить().Выгрузить());
	//Иначе
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	
	//	Пока Выборка.Следующий() Цикл
	//			
	//		НоваяСтрока = ЗапчастиКОтправке.Добавить();
	//		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	//			
	//		ПараметрыВалютыДок = Новый Структура("Валюта, Курс, Кратность", Валюта, Выборка.Курс, Выборка.Кратность);
	//		ПараметрыВалютыВР  = Новый Структура("Валюта, Курс, Кратность", ВалютаДоллар, Выборка.КурсДоллар,  Выборка.КратностьДоллар);
	//					
	//		НоваяСтрока.Цена = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(НоваяСтрока.Цена, ПараметрыВалютыВР, ПараметрыВалютыДок);
	//		НоваяСтрока.Сумма = НоваяСтрока.Цена * НоваяСтрока.Количество;
	//	КонецЦикла;

	//КонецЕсли;
	#КонецОбласти
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	смартЗаявкаНаГарантийныйРемонт.Ссылка КАК ЗаявкаСсылка,
	|	смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.Номенклатура КАК Номенклатура,
	|	СУММА(смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.Количество) КАК Количество,
	|	НоменклатураСпр.КодТНВЭД КАК КодТНВЭД,
	|	ВЫБОР
	|		КОГДА НоменклатураСпр.ВесЗнаменатель = 0
	|			ТОГДА НоменклатураСпр.ВесЧислитель
	|		ИНАЧЕ НоменклатураСпр.ВесЧислитель / НоменклатураСпр.ВесЗнаменатель
	|	КОНЕЦ КАК ВесНетто,
	|	ЕСТЬNULL(смартОписанияДляПретензий.Цена, 0) КАК Цена,
	|	СУММА(ЕСТЬNULL(смартОписанияДляПретензий.Цена, 0) * смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.Количество) КАК Сумма,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(смартОписанияДляПретензий.Описание КАК СТРОКА(1000)), """") КАК Описание,
	|	смартЗаявкаНаГарантийныйРемонт.Номер КАК НомерЗаявки,
	|	ЕСТЬNULL(смартОписанияДляПретензий.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) КАК Валюта
	//++ #4418 смарт: Тимофеева 26.09.2025 / Обработка Печать Сопроводительных Документов. Доработка.
	|   ,
	|   смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.НомерОтправления,
	|   смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.ДатаОтправления
	//-- #4418 смарт: Тимофеева 26.09.2025
    |ПОМЕСТИТЬ ВТ_ЗапчастиКОтправке
	|ИЗ
	|	Документ.смартЗаявкаНаГарантийныйРемонт.ЗаполняетсяСпециалистомПоПретензиям КАК смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.смартЗаявкаНаГарантийныйРемонт КАК смартЗаявкаНаГарантийныйРемонт
	|		ПО смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.Ссылка = смартЗаявкаНаГарантийныйРемонт.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСпр
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.смартОписанияДляПретензий КАК смартОписанияДляПретензий
	|			ПО НоменклатураСпр.Ссылка = смартОписанияДляПретензий.Номенклатура
	|		ПО смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.Номенклатура = НоменклатураСпр.Ссылка
	|ГДЕ
	|	смартЗаявкаНаГарантийныйРемонт.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)
	//++ #4418 смарт: Тимофеева 26.09.2025 / Обработка Печать Сопроводительных Документов. Доработка.
	|	//И смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.НомерОтправления = &НомерОтправления
	|	И (смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.НомерОтправления = &НомерОтправления ИЛИ &НомерОтправления = """")
	|	И (смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.ДатаОтправления = &ДатаОтправления ИЛИ &ДатаОтправления = ДАТАВРЕМЯ(1,1,1))
	//-- #4418 смарт: Тимофеева 26.09.2025
	|
	|СГРУППИРОВАТЬ ПО
	|	смартЗаявкаНаГарантийныйРемонт.Ссылка,
	|	смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.Номенклатура,
	|	НоменклатураСпр.Наименование,
	|	НоменклатураСпр.КодТНВЭД,
	|	ЕСТЬNULL(смартОписанияДляПретензий.Цена, 0),
	|	ЕСТЬNULL(ВЫРАЗИТЬ(смартОписанияДляПретензий.Описание КАК СТРОКА(1000)), """"),
	|	ВЫБОР
	|		КОГДА НоменклатураСпр.ВесЗнаменатель = 0
	|			ТОГДА НоменклатураСпр.ВесЧислитель
	|		ИНАЧЕ НоменклатураСпр.ВесЧислитель / НоменклатураСпр.ВесЗнаменатель
	|	КОНЕЦ,
	|	смартЗаявкаНаГарантийныйРемонт.Номер,
	|	ЕСТЬNULL(смартОписанияДляПретензий.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
	//++ #4418 смарт: Тимофеева 26.09.2025 / Обработка Печать Сопроводительных Документов. Доработка.
	|   ,
	|   смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.НомерОтправления,
	|   смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.ДатаОтправления
	//-- #4418 смарт: Тимофеева 26.09.2025
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КурсыВалютСрезПоследних.Валюта КАК Валюта,
	|	КурсыВалютСрезПоследних.Курс КАК Курс,
	|	КурсыВалютСрезПоследних.Кратность КАК Кратность
	|ПОМЕСТИТЬ ВТ_КурсыВалют
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&Дата, Валюта = &Валюта) КАК КурсыВалютСрезПоследних
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Валюта,
	|	КурсыВалютСрезПоследних.Курс,
	|	КурсыВалютСрезПоследних.Кратность
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(
	|			&Дата,
	|			Валюта В
	|				(ВЫБРАТЬ
	|					ВТ_ЗапчастиКОтправке.Валюта
	|				ИЗ
	|					ВТ_ЗапчастиКОтправке)) КАК КурсыВалютСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗапчастиКОтправке.ЗаявкаСсылка КАК ЗаявкаСсылка,
	|	ВТ_ЗапчастиКОтправке.Номенклатура КАК Номенклатура,
	|	ВТ_ЗапчастиКОтправке.Количество КАК Количество,
	|	ВТ_ЗапчастиКОтправке.КодТНВЭД КАК КодТНВЭД,
	|	ВТ_ЗапчастиКОтправке.ВесНетто КАК ВесНетто,
	|	ВТ_ЗапчастиКОтправке.Цена КАК Цена,
	|	ВТ_ЗапчастиКОтправке.Сумма КАК Сумма,
	|	ВТ_ЗапчастиКОтправке.Описание КАК Описание,
	|	ВТ_ЗапчастиКОтправке.НомерЗаявки КАК НомерЗаявки,
	|	ВТ_ЗапчастиКОтправке.Валюта КАК Валюта,
	|	ЕСТЬNULL(ВТ_КурсыВалют.Курс, 1) КАК Курс,
	|	ЕСТЬNULL(ВТ_КурсыВалют.Кратность, 1) КАК Кратность,
	|	ЕСТЬNULL(ВТ_КурсыВалютДляПечати.Курс, 1) КАК КурсДляПечати,
	|	ЕСТЬNULL(ВТ_КурсыВалютДляПечати.Кратность, 1) КАК КратностьДляПечати
	//++ #4418 смарт: Тимофеева 26.09.2025 / Обработка Печать Сопроводительных Документов. Доработка.
	|   ,
	|   ВТ_ЗапчастиКОтправке.НомерОтправления,
	|   ВТ_ЗапчастиКОтправке.ДатаОтправления
	//-- #4418 смарт: Тимофеева 26.09.2025
	|ИЗ
	|	ВТ_ЗапчастиКОтправке КАК ВТ_ЗапчастиКОтправке
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КурсыВалют КАК ВТ_КурсыВалют
	|		ПО ВТ_ЗапчастиКОтправке.Валюта = ВТ_КурсыВалют.Валюта,
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КурсыВалют КАК ВТ_КурсыВалютДляПечати
	|		ПО ВТ_КурсыВалютДляПечати.Валюта = &Валюта";
	
	Запрос.УстановитьПараметр("НомерОтправления", 	НомерОтправления);
	//++ #4418 смарт: Тимофеева 26.09.2025 / Обработка Печать Сопроводительных Документов. Доработка.
	Запрос.УстановитьПараметр("ДатаОтправления", 	ДатаОтправления);
	//-- #4418 смарт: Тимофеева 26.09.2025
    Запрос.УстановитьПараметр("Валюта", 			Валюта);
	Запрос.УстановитьПараметр("Дата", 				Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 	
		НоваяСтрока = ЗапчастиКОтправке.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		Если НЕ Валюта = Выборка.Валюта Тогда
			ПараметрыВалютыДляПечати 	= Новый Структура("Валюта, Курс, Кратность", Валюта, Выборка.КурсДляПечати, Выборка.КратностьДляПечати);
			ПараметрыВалютыВР  			= Новый Структура("Валюта, Курс, Кратность", Выборка.Валюта, Выборка.Курс,  Выборка.Кратность);
		
			НоваяСтрока.Цена 	= РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(НоваяСтрока.Цена, ПараметрыВалютыВР, ПараметрыВалютыДляПечати);
			НоваяСтрока.Сумма 	= НоваяСтрока.Цена * НоваяСтрока.Количество;
		КонецЕсли
	КонецЦикла;  
	
	//-- #3978 смарт: Тимофеева 11.08.2025
КонецПроцедуры

#Область Печать

Функция СформироватьТабличныйДокументИнвойсMimaki() Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	
	Если Оператор = "TNT" Тогда
		ТабДок = СформироватьТабличныйДокументИнвойсMimakiTNT();
	ИначеЕсли Оператор = "DHL" Тогда
		ТабДок = СформироватьТабличныйДокументИнвойсMimakiDHL();
	КонецЕсли;
			
	Возврат ТабДок;
	
КонецФункции

Функция СформироватьТабличныйДокументИнвойсMimakiTNT()
	
	Макет = ПолучитьМакет("ИнвойсMimaki");
		
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИспользуемоеИмяФайла = "Инвойс";
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.НаименованиеСокращенное КАК НаименованиеСокращенное,
	|	Организации.НаименованиеМеждународное КАК НаименованиеМеждународное,
	|	Организации.ИНН КАК ИНН,
	|	Организации.КодПоОКПО КАК ОКПО,
	|	Организации.КПП КАК КПП,
	|	Организации.ОГРН КАК ОГРН,
	|	ЕСТЬNULL(ОрганизацииКонтактнаяИнформацияТелефон.Представление, ""8 (495) 663-91-11"") КАК ТелефонОрганизации,
	|	ЕСТЬNULL(БанковскиеСчетаОрганизаций.НомерСчета, ""40702810300050480177"") КАК НомерСчета,
	|	ЕСТЬNULL(КлассификаторБанков.Код, ""044525360"") КАК БИК,
	|	ЕСТЬNULL(БанковскиеСчетаОрганизаций.КоррСчетБанка, ""30101810445250000360"") КАК КоррСчет,
	|	ЕСТЬNULL(КлассификаторБанков.Наименование, ""Филиал """"Корпоративный"""" ПАО """"Совкомбанк"""""") КАК НаименованиеБанка,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КлассификаторБанков.МеждународноеНаименование, """") = """"
	|			ТОГДА ""SOVCOMBANK, CORPORATE BRANCH""
	|		ИНАЧЕ КлассификаторБанков.МеждународноеНаименование
	|	КОНЕЦ КАК НаименованиеБанкаМеждународное
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформацияТелефон
	|		ПО (ОрганизацииКонтактнаяИнформацияТелефон.Ссылка = Организации.Ссылка)
	|			И (ОрганизацииКонтактнаяИнформацияТелефон.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонОрганизации))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчетаОрганизаций
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторБанков КАК КлассификаторБанков
	|			ПО БанковскиеСчетаОрганизаций.Банк = КлассификаторБанков.Ссылка
	|		ПО (БанковскиеСчетаОрганизаций.Владелец = Организации.Ссылка)
	|			И (НЕ БанковскиеСчетаОрганизаций.ПометкаУдаления)
	|			И (БанковскиеСчетаОрганизаций.Ссылка = &БанковскийСчет)
	|ГДЕ
	|	Организации.Ссылка = &Организация";
	
	Запрос.УстановитьПараметр("БанковскийСчет", БанковскийСчет);
	Запрос.УстановитьПараметр("Организация", Справочники.смартПредопределенныеЗначения.ОрганизацияДляЗаявкиНаГарантийныйРемонт.Значение);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОбластьДокумент = Макет.ПолучитьОбласть("Инвойс");
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ОбластьДокумент.Параметры, Выборка);
		ОбластьДокумент.Параметры.ВесБрутто 	= ВесБрутто;
		ОбластьДокумент.Параметры.ВесНетто 		= ЗапчастиКОтправке.Итог("ВесНетто");
		ОбластьДокумент.Параметры.Количество 	= ЗапчастиКОтправке.Итог("Количество");
		ОбластьДокумент.Параметры.Стоимость 	= ЗапчастиКОтправке.Итог("Сумма");

		ОбластьДокумент.Параметры.ДатаТекст = Формат(Дата, "ДФ='dd.MM.yyyy ""г.""'");
		ОбластьДокумент.Параметры.Дата 		= Дата;
		ОбластьДокумент.Параметры.НомерОтправления = НомерОтправления;
		
	КонецЦикла;
       
    ТабДок.Вывести(ОбластьДокумент);
    
    //++ смарт:ПА #843 22.12.2021 18:52:58
    ОбластьПодвал = Макет.ПолучитьОбласть("ПодвалИнвойс");
    Если ЗначениеЗаполнено(ЭтотОбъект.ЛицоСПравомПодписи) Тогда
        ОбластьПодвал.Параметры.Подписант 	= ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ЭтотОбъект.ЛицоСПравомПодписи.ФизическоеЛицо,ТекущаяДатаСеанса());
        ОбластьПодвал.Параметры.ДоверенностьПодписанта 		= ЭтотОбъект.ЛицоСПравомПодписи.ОснованиеПраваПодписи;
    КонецЕсли;
    ТабДок.Вывести(ОбластьПодвал);
    //-- смарт:ПА #843 22.12.2021 18:52:58
    
    Возврат ТабДок;
	
КонецФункции

Функция СформироватьТабличныйДокументИнвойсMimakiDHL()
	
	Макет = ПолучитьМакет("ИнвойсMimakiDHL");
		
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИспользуемоеИмяФайла = "Инвойс";
	ТабДок.АвтоМасштаб = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЧ.НомерЗаявки КАК НомерЗаявки,
	|	ТЧ.Номенклатура КАК Номенклатура,
	|	ТЧ.Количество КАК Количество,
	|	ТЧ.КодТНВЭД КАК КодТНВЭД,
	|	ТЧ.ВесНетто КАК ВесНетто,
	|	ТЧ.Цена КАК Цена,
	|	ТЧ.Описание КАК Описание,
	|	ТЧ.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВТ_ТЧ
	|ИЗ
	|	&ТЧ КАК ТЧ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ТЧ.Описание КАК Описание,
	|	ВТ_ТЧ.КодТНВЭД КАК КодТНВЭД,
	|	ВТ_ТЧ.Количество КАК Количество,
	|	ВТ_ТЧ.Сумма КАК Сумма,
	|	ВТ_ТЧ.Цена КАК Цена,
	|	ВТ_ТЧ.ВесНетто КАК ВесНетто,
	|	НоменклатураСпр.Наименование КАК НаименованиеНоменклатуры,
	|	ВТ_ТЧ.НомерЗаявки КАК НомерЗаявки,
	|	НоменклатураСпр.СтранаПроисхождения.Наименование КАК СтранаПроисхожденияНаименование,
	|	НоменклатураСпр.СтранаПроисхождения.МеждународноеНаименование КАК СтранаПроисхожденияМеждународноеНаименование
	|ИЗ
	|	ВТ_ТЧ КАК ВТ_ТЧ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСпр
	|		ПО ВТ_ТЧ.Номенклатура = НоменклатураСпр.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерЗаявки
	|;
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.НаименованиеСокращенное КАК НаименованиеСокращенное,
	|	Организации.НаименованиеМеждународное КАК НаименованиеМеждународное,
	|	Организации.ИНН КАК ИНН,
	|	Организации.КодПоОКПО КАК ОКПО,
	|	Организации.КПП КАК КПП,
	|	Организации.ОГРН КАК ОГРН,
	|	ЕСТЬNULL(ОрганизацииКонтактнаяИнформацияТелефон.Представление, ""8 (495) 663-91-11"") КАК ТелефонОрганизации,
	|	ЕСТЬNULL(БанковскиеСчетаОрганизаций.НомерСчета, ""40702810300050480177"") КАК НомерСчета,
	|	ЕСТЬNULL(КлассификаторБанков.Код, ""044525360"") КАК БИК,
	|	ЕСТЬNULL(БанковскиеСчетаОрганизаций.КоррСчетБанка, ""30101810445250000360"") КАК КоррСчет,
	|	ЕСТЬNULL(КлассификаторБанков.Наименование, ""Филиал """"Корпоративный"""" ПАО """"Совкомбанк"""""") КАК НаименованиеБанка,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КлассификаторБанков.МеждународноеНаименование, """") = """"
	|			ТОГДА ""SOVCOMBANK, CORPORATE BRANCH""
	|		ИНАЧЕ КлассификаторБанков.МеждународноеНаименование
	|	КОНЕЦ КАК НаименованиеБанкаМеждународное
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформацияТелефон
	|		ПО (ОрганизацииКонтактнаяИнформацияТелефон.Ссылка = Организации.Ссылка)
	|			И (ОрганизацииКонтактнаяИнформацияТелефон.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонОрганизации))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчетаОрганизаций
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторБанков КАК КлассификаторБанков
	|			ПО БанковскиеСчетаОрганизаций.Банк = КлассификаторБанков.Ссылка
	|		ПО (БанковскиеСчетаОрганизаций.Владелец = Организации.Ссылка)
	|			И (НЕ БанковскиеСчетаОрганизаций.ПометкаУдаления)
	|			И (БанковскиеСчетаОрганизаций.Ссылка = &БанковскийСчет)
	|ГДЕ
	|	Организации.Ссылка = &Организация";
	
	Запрос.УстановитьПараметр("ТЧ", ЗапчастиКОтправке.Выгрузить());
	Запрос.УстановитьПараметр("БанковскийСчет", БанковскийСчет);
	Запрос.УстановитьПараметр("Организация", Справочники.смартПредопределенныеЗначения.ОрганизацияДляЗаявкиНаГарантийныйРемонт.Значение);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ВыборкаШапка = Результат[Результат.Количество() - 1].Выбрать();
	ВыборкаСтроки = Результат[Результат.Количество() - 2].Выбрать();
	
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодвал");
	
	// ++ 10.05.2021
	ОбластьСтрока = Макет.ПолучитьОбласть("ОбластьСтрока");
	ОбластьПодпись = Макет.ПолучитьОбласть("ОбластьПодпись");
	ОбластьПодпись.Параметры.Дата = Формат(Дата, "ДФ=dd.MM.yyyy");
    
	 //++ смарт:ПА #843 22.12.2021 18:52:58
    Если ЗначениеЗаполнено(ЭтотОбъект.ЛицоСПравомПодписи) Тогда
        ОбластьПодпись.Параметры.Подписант 	= ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ЭтотОбъект.ЛицоСПравомПодписи.ФизическоеЛицо,ТекущаяДатаСеанса());
        ОбластьПодпись.Параметры.ДоверенностьПодписанта 		= ЭтотОбъект.ЛицоСПравомПодписи.ОснованиеПраваПодписи;
    КонецЕсли;
    //-- смарт:ПА #843 22.12.2021 18:52:58

	//СтрокаСПодвалом = Новый Массив; // Массив для проверки вывода 
	//СтрокаСПодвалом.Добавить(ОбластьСтрока); 
	//СтрокаСПодвалом.Добавить(ОбластьПодпись); 
	
	ВсегоСтрок = ВыборкаСтроки.Количество();
	КоличествоСтрок = 0;
	// --
	
	Пока ВыборкаШапка.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры, ВыборкаШапка);
		ОбластьШапка.Параметры.ВесБрутто 	= ВесБрутто;
		ОбластьШапка.Параметры.ВесНетто 	= ЗапчастиКОтправке.Итог("ВесНетто");
		//ОбластьШапка.Параметры.Количество 	= ЗапчастиКОтправке.Итог("Количество");

		ОбластьШапка.Параметры.Дата 		= Формат(Дата, "ДФ=yyyy-MM-dd");
		ОбластьШапка.Параметры.НомерОтправления = НомерОтправления;
			
	КонецЦикла;
	
	ТабДок.Вывести(ОбластьШапка);

	НомерПП = 1;
	
	Пока ВыборкаСтроки.Следующий() Цикл
		
		ОбластьСтрока = Макет.ПолучитьОбласть("ОбластьСтрока");
		ОбластьСтрока.Параметры.НомерПП 	= НомерПП;
		ОбластьСтрока.Параметры.Количество 	= ВыборкаСтроки.Количество;
		ОбластьСтрока.Параметры.Цена 		= Формат(ВыборкаСтроки.Цена, "ЧДЦ=2; ЧРД=.");	
		ОбластьСтрока.Параметры.Сумма 		= Формат(ВыборкаСтроки.Сумма, "ЧДЦ=2; ЧРД=.");
		ОбластьСтрока.Параметры.Описание 	= "" + ВыборкаСтроки.НомерЗаявки + " " + ВыборкаСтроки.Описание;
		ОбластьСтрока.Параметры.Валюта 		= Валюта;
		
		Если ЗначениеЗаполнено(ВыборкаСтроки.СтранаПроисхожденияМеждународноеНаименование) Тогда
			ОбластьСтрока.Параметры.Страна = ВыборкаСтроки.СтранаПроисхожденияМеждународноеНаименование;
		Иначе
			ОбластьСтрока.Параметры.Страна = ПолучитьСтрануНаАнгл(ВыборкаСтроки.СтранаПроисхожденияНаименование);
		КонецЕсли;
		
		НомерПП = НомерПП + 1;
		
		// ++ 10.05.2021
		КоличествоСтрок = КоличествоСтрок + 1;
		СтрокаСПодвалом = Новый Массив; // Массив для проверки вывода 
		СтрокаСПодвалом.Добавить(ОбластьСтрока); 
		СтрокаСПодвалом.Добавить(ОбластьПодпись);
		//++ смарт:ММ 635 19.10.2021
		Если КоличествоСтрок = ВсегоСтрок Тогда
			СтрокаСПодвалом.Добавить(ОбластьПодвал);
		КонецЕсли;
		//-- смарт:ММ 19.10.2021
		Если Не ТабДок.ПроверитьВывод(СтрокаСПодвалом) Тогда
			ТабДок.Вывести(ОбластьПодпись);  
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();  
		КонецЕсли;
			
		// --
		
		ТабДок.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	
	//ОбластьПодвал.Параметры.Дата = Формат(Дата, "ДФ=dd.MM.yyyy");
	ОбластьПодвал.Параметры.Сумма = Формат(ЗапчастиКОтправке.Итог("Сумма"), "ЧДЦ=2; ЧРД=.");
	ОбластьПодвал.Параметры.Валюта = Валюта;
	
	ТабДок.Вывести(ОбластьПодвал);
	
	// ++ 10.05.2021
	ТабДок.Вывести(ОбластьПодпись);
	// --
	
	Возврат ТабДок;
	
КонецФункции

Функция ПолучитьСтрануНаАнгл(Наименование)
	
	Результат = Наименование;
	
	НаименованиеВРег = ВРег(Наименование);
	
	Если НаименованиеВРег = "ЯПОНИЯ" Тогда
		Результат = "Japan";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьТабличныйДокументПриложениеMimaki() Экспорт
	
	Макет = ПолучитьМакет("Приложение1Mimaki");
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ПолеСверху 	= 10;
	ТабДок.ПолеСлева 	= 5;
	ТабДок.ПолеСправа 	= 5;
	//ТабДок.ПолеСнизу 	= 10;
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЧ.НомерЗаявки КАК НомерЗаявки,
	|	ТЧ.Номенклатура КАК Номенклатура,
	|	ТЧ.Количество КАК Количество,
	|	ТЧ.КодТНВЭД КАК КодТНВЭД,
	|	ТЧ.ВесНетто КАК ВесНетто,
	|	ТЧ.Цена КАК Цена,
	|	ТЧ.Описание КАК Описание,
	|	ТЧ.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВТ_ТЧ
	|ИЗ
	|	&ТЧ КАК ТЧ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ТЧ.Описание КАК Описание,
	|	ВТ_ТЧ.КодТНВЭД КАК КодТНВЭД,
	|	ВТ_ТЧ.Количество КАК Количество,
	|	ВТ_ТЧ.Сумма КАК Сумма,
	|	ВТ_ТЧ.ВесНетто КАК ВесНетто,
	|	НоменклатураСпр.Наименование КАК НаименованиеНоменклатуры,
	|	ВТ_ТЧ.НомерЗаявки КАК НомерЗаявки
	|ИЗ
	|	ВТ_ТЧ КАК ВТ_ТЧ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСпр
	|		ПО ВТ_ТЧ.Номенклатура = НоменклатураСпр.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерЗаявки";
	
	Запрос.УстановитьПараметр("ТЧ", ЗапчастиКОтправке.Выгрузить());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОбластьШапка 	= Макет.ПолучитьОбласть("ОбластьШапка");
	ОбластьСтрока 	= Макет.ПолучитьОбласть("ОбластьСтрока");
	ОбластьПодвал 	= Макет.ПолучитьОбласть("ОбластьПодвал");
	ОбластьПодпись 	= Макет.ПолучитьОбласть("ОбластьПодпись");
	//ОбластьПусто 	= Макет.ПолучитьОбласть("ОбластьПустаяСтрока");
	
	ОбластьШапка.Параметры.Дата = Формат(Дата, "ДФ='dd.MM.yyyy ""г.""'");
	
	ТабДок.Вывести(ОбластьШапка);
	
	НомерПП = 1;
	
	НоваяСтраница = Ложь;
	СтрокаСПодвалом = Новый Массив; // Массив для проверки вывода 
	СтрокаСПодвалом.Добавить(ОбластьСтрока); 
	СтрокаСПодвалом.Добавить(ОбластьПодпись); 
	//СтрокаСПодвалом.Добавить(ОбластьПусто);
    
    //++ смарт:ПА #843 22.12.2021 18:52:58
    Если ЗначениеЗаполнено(ЭтотОбъект.ЛицоСПравомПодписи) Тогда
        ОбластьПодпись.Параметры.Подписант 	= ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ЭтотОбъект.ЛицоСПравомПодписи.ФизическоеЛицо,ТекущаяДатаСеанса());
        ОбластьПодпись.Параметры.ДоверенностьПодписанта 		= ЭтотОбъект.ЛицоСПравомПодписи.ОснованиеПраваПодписи;
    КонецЕсли;
    //-- смарт:ПА #843 22.12.2021 18:52:58

	СуммаИтого = 0;
	КоличествоИтого = 0;
	
	КоличествоСтраниц = 1;
		
	Пока Выборка.Следующий() Цикл
		
		ОбластьСтрока = Макет.ПолучитьОбласть("ОбластьСтрока");
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, Выборка);
		ОбластьСтрока.Параметры.НомерПП = НомерПП;
		//ОбластьСтрока.Параметры.Описание = "" + Выборка.НомерЗаявки + " " + Выборка.НаименованиеНоменклатуры + " " + Выборка.Описание;
		ОбластьСтрока.Параметры.Описание = "" + Выборка.НомерЗаявки + " " + Выборка.Описание;
		
		СуммаИтого = СуммаИтого + Выборка.Сумма;
		КоличествоИтого = КоличествоИтого + Выборка.Количество;
		
		НомерПП = НомерПП + 1;
		
		Если Не ТабДок.ПроверитьВывод(СтрокаСПодвалом) Тогда 			
			ТабДок.Вывести(ОбластьПодпись);  
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();  
			КоличествоСтраниц = КоличествоСтраниц + 1;
		КонецЕсли; 
		
		ТабДок.Вывести(ОбластьСтрока);
		
	КонецЦикла;
	
	ОбластьПодвал.Параметры.Сумма = СуммаИтого;
	ОбластьПодвал.Параметры.Количество = КоличествоИтого;
	ТабДок.Вывести(ОбластьПодвал);
    
	ТабДок.Вывести(ОбластьПодпись);
	
	Если КоличествоСтраниц > 1 Тогда
		ТабДок.НижнийКолонтитул.Выводить = Истина;
		ТабДок.НижнийКолонтитул.ТекстВЦентре = "-СТР.[&НомерСтраницы]-";
	КонецЕсли;
	
	Возврат ТабДок;

КонецФункции

Функция СформироватьТабличныйДокументРекламационныйАктMimaki() Экспорт
	
	Макет = ПолучитьМакет("РекламационныйАктMimaki");
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ПолеСверху 	= 10;
	ТабДок.ПолеСлева 	= 5;
	ТабДок.ПолеСправа 	= 5;
	//ТабДок.ПолеСнизу 	= 10;
	ТабДок.АвтоМасштаб = Истина;
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЧ.НомерЗаявки КАК НомерЗаявки,
	|	ТЧ.Номенклатура КАК Номенклатура,
	|	ТЧ.Количество КАК Количество,
	|	ТЧ.КодТНВЭД КАК КодТНВЭД,
	|	ТЧ.ВесНетто КАК ВесНетто,
	|	ТЧ.Цена КАК Цена,
	|	ТЧ.Описание КАК Описание,
	|	ТЧ.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВТ_ТЧ
	|ИЗ
	|	&ТЧ КАК ТЧ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ТЧ.Описание КАК Описание,
	|	ВТ_ТЧ.КодТНВЭД КАК КодТНВЭД,
	|	ВТ_ТЧ.Количество КАК Количество,
	|	ВТ_ТЧ.Сумма КАК Сумма,
	|	ВТ_ТЧ.ВесНетто КАК ВесНетто,
	|	НоменклатураСпр.Наименование КАК НаименованиеНоменклатуры,
	|	ВТ_ТЧ.НомерЗаявки КАК НомерЗаявки,
	|	ЕСТЬNULL(ОрганизацииКонтактнаяИнформацияАдрес.Представление, """") КАК ЮрАдрес,
	|	ОрганизацииСпр.НаименованиеСокращенное КАК НаименованиеСокращенное,
	|	ВТ_ТЧ.Цена КАК Цена
	|ИЗ
	|	ВТ_ТЧ КАК ВТ_ТЧ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСпр
	|		ПО ВТ_ТЧ.Номенклатура = НоменклатураСпр.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК ОрганизацииСпр
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформацияАдрес
	|			ПО ОрганизацииСпр.Ссылка = ОрганизацииКонтактнаяИнформацияАдрес.Ссылка
	|				И (ОрганизацииКонтактнаяИнформацияАдрес.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации))
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ОрганизацииСпр.Ссылка = &Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерЗаявки
	|ИТОГИ
	|	МАКСИМУМ(ЮрАдрес),
	|	МАКСИМУМ(НаименованиеСокращенное)
	|ПО
	|	ОрганизацииСпр.Ссылка";
	
	Запрос.УстановитьПараметр("ТЧ", ЗапчастиКОтправке.Выгрузить());
	Запрос.УстановитьПараметр("Организация", Справочники.смартПредопределенныеЗначения.ОрганизацияДляЗаявкиНаГарантийныйРемонт.Значение);
	
	ВыборкаОрганизации = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаОрганизации.Следующий() Цикл
		
		ОбластьЗаголовок= Макет.ПолучитьОбласть("ОбластьЗаголовок");
		ОбластьШапка 	= Макет.ПолучитьОбласть("ОбластьШапка");
		ОбластьСтрока 	= Макет.ПолучитьОбласть("ОбластьСтрока");
		ОбластьПодвал 	= Макет.ПолучитьОбласть("ОбластьПодвал");
		ОбластьПодпись 	= Макет.ПолучитьОбласть("ОбластьПодпись");
		
		ОбластьЗаголовок.Параметры.НаименованиеСокращенное = ВыборкаОрганизации.НаименованиеСокращенное;
		ОбластьЗаголовок.Параметры.ЮрАдрес = ВыборкаОрганизации.ЮрАдрес;
		
		// ++ 22.03.2021		
		ОтправляемогоЧего = "отправляемого оборудования";
		
		Если ЗаменаЧего = "чернила" Тогда
			ОтправляемогоЧего = "отправляемых чернил";
		КонецЕсли;
		
		ОбластьЗаголовок.Параметры.ОтправляемогоЧего = ОтправляемогоЧего;
		// --
		
		ОбластьЗаголовок.Параметры.ЗаменаЧего = ЗаменаЧего;		
				
		ТабДок.Вывести(ОбластьЗаголовок);
		ТабДок.Вывести(ОбластьШапка);
		
		НомерПП = 1;
		
		НоваяСтраница = Ложь;
		СтрокаСПодвалом = Новый Массив; // Массив для проверки вывода 
		СтрокаСПодвалом.Добавить(ОбластьСтрока); 
		СтрокаСПодвалом.Добавить(ОбластьПодпись);
        
        //++ смарт:ПА #843 22.12.2021 18:52:58
        Если ЗначениеЗаполнено(ЭтотОбъект.ЛицоСПравомПодписи) Тогда
            ОбластьПодпись.Параметры.Подписант 	= ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ЭтотОбъект.ЛицоСПравомПодписи.ФизическоеЛицо,ТекущаяДатаСеанса());
            ОбластьПодпись.Параметры.ДоверенностьПодписанта 		= ЭтотОбъект.ЛицоСПравомПодписи.ОснованиеПраваПодписи;
        КонецЕсли;
        //-- смарт:ПА #843 22.12.2021 18:52:58

		СуммаИтого = 0;
		
		КоличествоСтраниц = 1;
		Выборка = ВыборкаОрганизации.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ОбластьСтрока = Макет.ПолучитьОбласть("ОбластьСтрока");
			ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, Выборка);
			ОбластьСтрока.Параметры.НомерПП = НомерПП;
			//ОбластьСтрока.Параметры.Описание = "" + Выборка.НомерЗаявки + " " + Выборка.НаименованиеНоменклатуры + " " + Выборка.Описание;
			ОбластьСтрока.Параметры.Описание = "" + Выборка.НомерЗаявки + " " + Выборка.Описание;
			
			СуммаИтого = СуммаИтого + Выборка.Сумма;
			
			НомерПП = НомерПП + 1;
			
			Если Не ТабДок.ПроверитьВывод(СтрокаСПодвалом) Тогда			
				ТабДок.Вывести(ОбластьПодпись);  
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц(); 
				ТабДок.Вывести(ОбластьШапка);
				КоличествоСтраниц = КоличествоСтраниц + 1;
			КонецЕсли; 
			
			// ++ 27.11.2020
			Если Оператор = "DHL" Тогда
				ОбластьСтрока.Параметры.Цена = Формат(ОбластьСтрока.Параметры.Цена, "ЧДЦ=2; ЧРД=.");
				ОбластьСтрока.Параметры.Сумма = Формат(ОбластьСтрока.Параметры.Сумма, "ЧДЦ=2; ЧРД=.");
			КонецЕсли;
			// --
			
			ТабДок.Вывести(ОбластьСтрока);
			
		КонецЦикла;
		
		ОбластьПодвал.Параметры.Сумма = СуммаИтого;
		
		// ++ 27.11.2020
		Если Оператор = "DHL" Тогда
			ОбластьПодвал.Параметры.Сумма = Формат(ОбластьПодвал.Параметры.Сумма, "ЧДЦ=2; ЧРД=.");
		КонецЕсли;
		// --
		
		ТабДок.Вывести(ОбластьПодвал);
		
		ТабДок.Вывести(ОбластьПодпись);
				
		Если КоличествоСтраниц > 1 Тогда
			ТабДок.НижнийКолонтитул.Выводить = Истина;
			ТабДок.НижнийКолонтитул.ТекстВЦентре = "-СТР.[&НомерСтраницы]-";
			// ++ 06.05.2021
			ТабДок.НижнийКолонтитул.ТекстСправа = "";
			// --
		КонецЕсли;
	
	КонецЦикла;

	Возврат ТабДок;

КонецФункции

//++ #3978 смарт: Тимофеева 11.08.2025 / Печать сопроводительных документов. Замена печатных форм
Функция СформироватьТабличныйДокументРекламационныйАкт() Экспорт
	
	Макет = ПолучитьМакет("ПФ_MXL_РекламационныйАкт");
	
	ОбластьЗаголовок	= Макет.ПолучитьОбласть("ОбластьЗаголовок");
	ОбластьШапка 		= Макет.ПолучитьОбласть("ОбластьШапка");
	ОбластьСтрока 		= Макет.ПолучитьОбласть("ОбластьСтрока");
	ОбластьПодвал 		= Макет.ПолучитьОбласть("ОбластьПодвал");
	ОбластьПодпись 		= Макет.ПолучитьОбласть("ОбластьПодпись");
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ПолеСверху 	= 10;
	ТабДок.ПолеСлева 	= 5;
	ТабДок.ПолеСправа 	= 5;
	//ТабДок.ПолеСнизу 	= 10;
	ТабДок.АвтоМасштаб = Истина;
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЧ.НомерЗаявки КАК НомерЗаявки,
	|	ТЧ.ЗаявкаСсылка КАК ЗаявкаСсылка,
	|	ТЧ.Номенклатура КАК Номенклатура,
	|	ТЧ.Количество КАК Количество,
	|	ТЧ.КодТНВЭД КАК КодТНВЭД,
	|	ТЧ.ВесНетто КАК ВесНетто,
	|	ТЧ.Цена КАК Цена,
	|	ТЧ.Описание КАК Описание,
	|	ТЧ.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВТ_ТЧ
	|ИЗ
	|	&ТЧ КАК ТЧ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ТЧ.ЗаявкаСсылка КАК ЗаявкаСсылка,
	|	смартЗаявкаНаГарантийныйРемонт.Оборудование КАК Оборудование,
	|	смартЗаявкаНаГарантийныйРемонт.Серия КАК Серия,
	|	СправочникНоменклатура.Артикул КАК АртикулОборудования,
	|	СправочникНоменклатура.Марка КАК МаркаОборудования
	|ПОМЕСТИТЬ ВТ_ОборудованиеЗаявок
	|ИЗ
	|	ВТ_ТЧ КАК ВТ_ТЧ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.смартЗаявкаНаГарантийныйРемонт КАК смартЗаявкаНаГарантийныйРемонт
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|			ПО смартЗаявкаНаГарантийныйРемонт.Оборудование = СправочникНоменклатура.Ссылка
	|		ПО ВТ_ТЧ.ЗаявкаСсылка = смартЗаявкаНаГарантийныйРемонт.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПриобретениеТоваровУслуг.Контрагент КАК Контрагент
	|ИЗ
	|	ВТ_ТЧ КАК ВТ_ТЧ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.смартЗаявкаНаГарантийныйРемонт КАК смартЗаявкаНаГарантийныйРемонт
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
	|			ПО смартЗаявкаНаГарантийныйРемонт.ДокументПриобретения = ПриобретениеТоваровУслуг.Ссылка
	|		ПО ВТ_ТЧ.ЗаявкаСсылка = смартЗаявкаНаГарантийныйРемонт.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ТоварыОрганизацийОбороты.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	ТоварыОрганизацийОбороты.АналитикаУчетаНоменклатуры.Серия КАК Серия,
	|	ТоварыОрганизацийОбороты.НомерГТД КАК НомерГТД
	|ИЗ
	|	РегистрНакопления.ТоварыОрганизаций.Обороты(
	|			,
	|			,
	|			,
	|			(АналитикаУчетаНоменклатуры.Номенклатура, АналитикаУчетаНоменклатуры.Серия) В
	|				(ВЫБРАТЬ
	|					ВТ_Оборудование.Оборудование КАК Номенклатура,
	|					ВТ_Оборудование.Серия КАК Серия
	|				ИЗ
	|					ВТ_ОборудованиеЗаявок КАК ВТ_Оборудование)) КАК ТоварыОрганизацийОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	//++ #Б-6296 смарт: Фролов 03.04.2026 //Печать сопроводительных документов. Некорректно выводится Рекламационный акт
	//|	ВТ_ТЧ.Описание КАК Описание,
	|	ПОДСТРОКА(ВТ_ТЧ.Описание, 0, 1024) КАК Описание,
	//-- #Б-6296 смарт: Фролов 03.04.2026
	|	ВТ_ТЧ.КодТНВЭД КАК КодТНВЭД,
	|	ВТ_ТЧ.Количество КАК Количество,
	|	ВТ_ТЧ.Сумма КАК Сумма,
	|	ВТ_ТЧ.ВесНетто КАК ВесНетто,
	|	ВТ_ТЧ.НомерЗаявки КАК НомерЗаявки,
	|	ВТ_ТЧ.Цена КАК Цена,
	|	ВТ_ОборудованиеЗаявок.Оборудование КАК Оборудование,
	|	ВТ_ОборудованиеЗаявок.Серия КАК Серия,
	|	ВТ_ОборудованиеЗаявок.Серия.Номер КАК НомерСерии,
	|	ВТ_ОборудованиеЗаявок.АртикулОборудования КАК АртикулОборудования,
	|	ВТ_ОборудованиеЗаявок.МаркаОборудования КАК МаркаОборудования
	|ИЗ
	|	ВТ_ТЧ КАК ВТ_ТЧ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОборудованиеЗаявок КАК ВТ_ОборудованиеЗаявок
	|		ПО ВТ_ТЧ.ЗаявкаСсылка = ВТ_ОборудованиеЗаявок.ЗаявкаСсылка
	|
	//++ #Б-6296 смарт: Фролов 03.04.2026 //Печать сопроводительных документов. Некорректно выводится Рекламационный акт
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТЧ.КодТНВЭД,
	|	ВТ_ТЧ.НомерЗаявки,
	|	ВТ_ОборудованиеЗаявок.Серия,
	|	ВТ_ТЧ.Сумма,
	|	ВТ_ОборудованиеЗаявок.АртикулОборудования,
	|	ВТ_ТЧ.ВесНетто,
	|	ВТ_ОборудованиеЗаявок.Оборудование,
	|	ВТ_ТЧ.Количество,
	|	ВТ_ТЧ.Цена,
	|	ВТ_ОборудованиеЗаявок.МаркаОборудования,
	|	ВТ_ОборудованиеЗаявок.Серия.Номер,
	|	ПОДСТРОКА(ВТ_ТЧ.Описание, 0, 1024) 
	//-- #Б-6296 смарт: Фролов 03.04.2026
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерЗаявки";
	
	Запрос.УстановитьПараметр("ТЧ",	ЗапчастиКОтправке.Выгрузить());
	
	РезультатЗапроса 	= Запрос.ВыполнитьПакет();
	МассивПолучателей	= РезультатЗапроса[2].Выгрузить().ВыгрузитьКолонку("Контрагент");
	ГТДОборудования		= РезультатЗапроса[3].Выгрузить();
	ВыборкаТовары		= РезультатЗапроса[4].Выбрать();
	
	ДатаФормирования	= ЭтотОбъект.Дата;
	
	ОбластьЗаголовок.Параметры.НомерАкта 	= Формат(ДатаФормирования, "ДФ='dMMyy'");
	ОбластьЗаголовок.Параметры.ДатаАкта		= Формат(ДатаФормирования, "ДФ='dd.MM.yyyy ""г.""'");

	Организация 		= Справочники.смартПредопределенныеЗначения.ОрганизацияДляЗаявкиНаГарантийныйРемонт.Значение;
	Сведения 			= ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Организация, ДатаФормирования);

	ОбластьЗаголовок.Параметры.НаименованиеСокращенное 	= Сведения.СокращенноеНаименование;
	ОбластьЗаголовок.Параметры.ЮрАдрес 					= Сведения.ЮридическийАдрес;	
	ОбластьЗаголовок.Параметры.НаименованиеПолучателя 	= СтрСоединить(МассивПолучателей, ", ");
	ОбластьЗаголовок.Параметры.ОтправляемогоЧего 		= ?(ЭтотОбъект.ЗаменаЧего = "чернила", "отправляемых чернил", 
																					"отправляемого оборудования");
	ОбластьЗаголовок.Параметры.ЗаменаЧего 				= ЭтотОбъект.ЗаменаЧего;		
	
	ТабДок.Вывести(ОбластьЗаголовок);
	
	ВалютыИОбозначения 		= ПолучитьСоответствиеОбозначенияВалюты();
	СимволВалюты		 	= ВалютыИОбозначения.Получить(ЭтотОбъект.Валюта);
	ОбластьШапка.Параметры.СимволВалюты = ?(СимволВалюты = Неопределено, ЭтотОбъект.Валюта, СимволВалюты); 
	ТабДок.Вывести(ОбластьШапка);
		
	СтрокаСПодвалом = Новый Массив; // Массив для проверки вывода 
	СтрокаСПодвалом.Добавить(ОбластьСтрока); 
	СтрокаСПодвалом.Добавить(ОбластьПодпись);
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ЛицоСПравомПодписи) Тогда
		ОбластьПодпись.Параметры.Подписант 	= ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ЭтотОбъект.ЛицоСПравомПодписи.ФизическоеЛицо,
																						ТекущаяДатаСеанса());
		ОбластьПодпись.Параметры.ДоверенностьПодписанта 		= ЭтотОбъект.ЛицоСПравомПодписи.ОснованиеПраваПодписи;
	КонецЕсли;
	
	НомерПП 			= 1;
	СуммаИтого 			= 0;	
	КоличествоСтраниц 	= 1;
		
	Пока ВыборкаТовары.Следующий() Цикл 	
		ОбластьСтрока 						= Макет.ПолучитьОбласть("ОбластьСтрока");
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, ВыборкаТовары);
		ОбластьСтрока.Параметры.НомерПП 	= НомерПП;
		
		НомерГТД 				= ГТДОборудования.Скопировать(Новый Структура("Номенклатура, Серия", 
													ВыборкаТовары.Оборудование, ВыборкаТовары.Серия));
		ДополнительныеОписание 	= СтрШаблон("Была изъята из режущего плоттера т.м. %1, модели %2, С/Н %3, ДТ №%4", 
													ВРег(ВыборкаТовары.МаркаОборудования),
													ВыборкаТовары.АртикулОборудования, 
													ВыборкаТовары.НомерСерии, 
													СокрЛП(СтрСоединить(НомерГТД.ВыгрузитьКолонку("НомерГТД"), ",")));
		
		ОбластьСтрока.Параметры.Описание 	= СтрШаблон("%1 %2
													|%3", 
													ВыборкаТовары.НомерЗаявки,
													ВыборкаТовары.Описание,
													ДополнительныеОписание);
		
		СуммаИтого 	= СуммаИтого + ВыборкаТовары.Сумма;		
		НомерПП 	= НомерПП + 1;
		
		Если НЕ ТабДок.ПроверитьВывод(СтрокаСПодвалом) Тогда			
			ТабДок.Вывести(ОбластьПодпись);  
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц(); 
			ТабДок.Вывести(ОбластьШапка);
			КоличествоСтраниц = КоличествоСтраниц + 1;
		КонецЕсли; 
		
		Если Оператор = "DHL" Тогда
			ОбластьСтрока.Параметры.Цена = Формат(ОбластьСтрока.Параметры.Цена, "ЧДЦ=2; ЧРД=.");
			ОбластьСтрока.Параметры.Сумма = Формат(ОбластьСтрока.Параметры.Сумма, "ЧДЦ=2; ЧРД=.");
		КонецЕсли;
		
		ТабДок.Вывести(ОбластьСтрока);		
	КонецЦикла;
	
	ОбластьПодвал.Параметры.Валюта = СтрШаблон("%1 %2", ЭтотОбъект.Валюта.НаименованиеПолное, ЭтотОбъект.Валюта);
	ОбластьПодвал.Параметры.Сумма = СуммаИтого;
	
	Если Оператор = "DHL" Тогда
		ОбластьПодвал.Параметры.Сумма = Формат(ОбластьПодвал.Параметры.Сумма, "ЧДЦ=2; ЧРД=.");
	КонецЕсли;
	
	ТабДок.Вывести(ОбластьПодвал);	
	ТабДок.Вывести(ОбластьПодпись);
	
	Если КоличествоСтраниц > 1 Тогда
		ТабДок.НижнийКолонтитул.Выводить = Истина;
		ТабДок.НижнийКолонтитул.ТекстВЦентре = "-СТР.[&НомерСтраницы]-";
		ТабДок.НижнийКолонтитул.ТекстСправа = "";
	КонецЕсли;
	
	Возврат ТабДок;

КонецФункции

//++ #Б-5960 смарт: Фролов 06.03.2026 //Печать сопроводительных документов. Новый бланк
Функция СформироватьТабличныйДокументБланкПередачиБрака() Экспорт
	
	Макет = ПолучитьМакет("ПФ_MXL_БланкПередачиБрака");
	
	ОбластьЗаголовок	= Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка 		= Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока 		= Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал 		= Макет.ПолучитьОбласть("Подвал");
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ПолеСверху 	= 10;
	ТабДок.ПолеСлева 	= 5;
	ТабДок.ПолеСправа 	= 5;
	ТабДок.АвтоМасштаб = Истина;
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЧ.НомерЗаявки КАК НомерЗаявки,
	|	ТЧ.ЗаявкаСсылка КАК ЗаявкаСсылка,
	|	ТЧ.Номенклатура КАК Номенклатура,
	|	ТЧ.Количество КАК Количество,
	|	ТЧ.КодТНВЭД КАК КодТНВЭД,
	|	ТЧ.ВесНетто КАК ВесНетто,
	|	ТЧ.Цена КАК Цена,
	|	ТЧ.Описание КАК Описание,
	|	ТЧ.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВТ_ТЧ
	|ИЗ
	|	&ТЧ КАК ТЧ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПриобретениеТоваровУслуг.Контрагент КАК Контрагент
	|ИЗ
	|	ВТ_ТЧ КАК ВТ_ТЧ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.смартЗаявкаНаГарантийныйРемонт КАК смартЗаявкаНаГарантийныйРемонт
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
	|			ПО смартЗаявкаНаГарантийныйРемонт.ДокументПриобретения = ПриобретениеТоваровУслуг.Ссылка
	|		ПО ВТ_ТЧ.ЗаявкаСсылка = смартЗаявкаНаГарантийныйРемонт.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТЧ.Количество КАК Количество,
	|	ВТ_ТЧ.НомерЗаявки КАК НомерЗаявки,
	|	ВТ_ТЧ.Цена КАК Цена,
	|	ВТ_ТЧ.Номенклатура.Артикул КАК Артикул,
	|	ВТ_ТЧ.Номенклатура.Наименование КАК Номенклатура,
	|	ВТ_ТЧ.Номенклатура.НаименованиеАнгл КАК НоменклатураАнгл
	|ИЗ
	|	ВТ_ТЧ КАК ВТ_ТЧ
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерЗаявки";
	
	Запрос.УстановитьПараметр("ТЧ",	ЗапчастиКОтправке.Выгрузить());
	
	РезультатЗапроса 	= Запрос.ВыполнитьПакет();
	МассивПолучателей	= РезультатЗапроса[1].Выгрузить().ВыгрузитьКолонку("Контрагент");
	ВыборкаТовары		= РезультатЗапроса[2].Выбрать();
	
	ДатаФормирования	= ЭтотОбъект.Дата;
	
	ОбластьЗаголовок.Параметры.Поставщик 	= СтрСоединить(МассивПолучателей, ", ");

	ТабДок.Вывести(ОбластьЗаголовок);
	
	ТабДок.Вывести(ОбластьШапка);
		
	СтрокаСПодвалом = Новый Массив; // Массив для проверки вывода 
	СтрокаСПодвалом.Добавить(ОбластьСтрока); 
	
	НомерПП 			= 1;
	КоличествоСтраниц 	= 1;
		
	Пока ВыборкаТовары.Следующий() Цикл 	
		ОбластьСтрока 						= Макет.ПолучитьОбласть("Строка");
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, ВыборкаТовары);
		ОбластьСтрока.Параметры.НомерПП 	= НомерПП;
				
		НомерПП 	= НомерПП + 1;
		
		Если НЕ ТабДок.ПроверитьВывод(СтрокаСПодвалом) Тогда			
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц(); 
			ТабДок.Вывести(ОбластьШапка);
			КоличествоСтраниц = КоличествоСтраниц + 1;
		КонецЕсли; 
		
		ТабДок.Вывести(ОбластьСтрока);
		
	КонецЦикла;
	
	ОбластьПодвал.Параметры.НомерОтправления = НомерОтправления;
	ОбластьПодвал.Параметры.Поставщик = ОбластьЗаголовок.Параметры.Поставщик;
	
	ТабДок.Вывести(ОбластьПодвал);	
	
	Если КоличествоСтраниц > 1 Тогда
		ТабДок.НижнийКолонтитул.Выводить = Истина;
		ТабДок.НижнийКолонтитул.ТекстВЦентре = "-СТР.[&НомерСтраницы]-";
		ТабДок.НижнийКолонтитул.ТекстСправа = "";
	КонецЕсли;
	
	Возврат ТабДок;

КонецФункции //-- #Б-5690 смарт: Фролов 06.03.2026

Функция СформироватьТабличныйДокументИнвойс() Экспорт
	
	Макет = ПолучитьМакет("ПФ_MXL_Инвойс");
	
	ОбластьЗаголовок	= Макет.ПолучитьОбласть("ОбластьЗаголовок");
	ОбластьШапка 		= Макет.ПолучитьОбласть("ОбластьШапка");
	ОбластьСтрока 		= Макет.ПолучитьОбласть("ОбластьСтрока");
	ОбластьПодвал 		= Макет.ПолучитьОбласть("ОбластьПодвал");

	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИспользуемоеИмяФайла = "Инвойс";
	ТабДок.ПолеСверху 	= 7;
	ТабДок.ПолеСлева 	= 0;
	ТабДок.ПолеСправа 	= 0;
	ТабДок.ПолеСнизу 	= 20;
	ТабДок.АвтоМасштаб 	= Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЧ.НомерЗаявки КАК НомерЗаявки,
	|	ТЧ.ЗаявкаСсылка КАК ЗаявкаСсылка,
	|	ТЧ.Номенклатура КАК Номенклатура,
	|	ТЧ.Количество КАК Количество,
	|	ТЧ.КодТНВЭД КАК КодТНВЭД,
	|	ТЧ.ВесНетто КАК ВесНетто,
	|	ТЧ.Цена КАК Цена,
	|	ТЧ.Описание КАК Описание,
	|	ТЧ.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВТ_ТЧ
	|ИЗ
	|	&ТЧ КАК ТЧ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ТЧ.Описание КАК Описание,
	|	ВТ_ТЧ.КодТНВЭД КАК КодТНВЭД,
	|	ВТ_ТЧ.Количество КАК Количество,
	|	ВТ_ТЧ.Сумма КАК Сумма,
	|	ВТ_ТЧ.ВесНетто КАК ВесНетто,
	|	ВТ_ТЧ.НомерЗаявки КАК НомерЗаявки,
	|	ВТ_ТЧ.Цена КАК Цена,
	|	ЕСТЬNULL(ПриобретениеТоваровУслуг.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Получатель,
	|	ЕСТЬNULL(НоменклатураОборудования.Марка, """") КАК Марка
	|ИЗ
	|	ВТ_ТЧ КАК ВТ_ТЧ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.смартЗаявкаНаГарантийныйРемонт КАК смартЗаявкаНаГарантийныйРемонт
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
	|			ПО смартЗаявкаНаГарантийныйРемонт.ДокументПриобретения = ПриобретениеТоваровУслуг.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураОборудования
	|			ПО смартЗаявкаНаГарантийныйРемонт.Оборудование = НоменклатураОборудования.Ссылка
	|		ПО ВТ_ТЧ.ЗаявкаСсылка = смартЗаявкаНаГарантийныйРемонт.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерЗаявки
	|ИТОГИ ПО
	|	Получатель";
	
	Запрос.УстановитьПараметр("ТЧ",	ЗапчастиКОтправке.Выгрузить());
	
	РезультатЗапроса	= Запрос.Выполнить();	
	ВыборкаПолучатели	= РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ДатаФормирования	= ЭтотОбъект.Дата;
	
	Пока ВыборкаПолучатели.Следующий() Цикл 
				
		ОбластьЗаголовок.Параметры.Номер 		= Формат(ДатаФормирования, "ДФ='dMMyy'");
		ОбластьЗаголовок.Параметры.Дата 		= Формат(ДатаФормирования, "ДФ='dd.MM.yyyy'");
		
		Сведения 								= ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ВыборкаПолучатели.Получатель, ДатаФормирования);
        ОбластьЗаголовок.Параметры.Получатель 	= ?(ЗначениеЗаполнено(Сведения.ПолноеНаименование), Сведения.ПолноеНаименование, ВыборкаПолучатели.Получатель);
		ОбластьЗаголовок.Параметры.ФактическийАдресПолучателя	= Сведения.ФактическийАдрес; 
		ОбластьЗаголовок.Параметры.ТелефонПолучателя 			= Сведения.Телефоны;
        ОбластьЗаголовок.Параметры.КонтактноеЛицоПолучателя		= ВыборкаПолучатели.Получатель.смартОтветственныйЗаЭДО;
		
		ТабДок.Вывести(ОбластьЗаголовок);
		
		ОбластьШапка.Параметры.Валюта = ЭтотОбъект.Валюта;
		ТабДок.Вывести(ОбластьШапка);
		
		СтрокаСПодвалом 	= Новый Массив; // Массив для проверки вывода 
		СтрокаСПодвалом.Добавить(ОбластьСтрока); 
		СтрокаСПодвалом.Добавить(ОбластьПодвал);
        		
		НомерПП 			= 1;
		СуммаИтого 			= 0;		
		КоличествоСтраниц 	= 1;
		МаркиОборудования	= Новый Массив;
		
		Выборка = ВыборкаПолучатели.Выбрать();
		
		Пока Выборка.Следующий() Цикл			
			ОбластьСтрока = Макет.ПолучитьОбласть("ОбластьСтрока");
			ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, Выборка);
			ОбластьСтрока.Параметры.НомерПП = НомерПП;
			ОбластьСтрока.Параметры.Описание = СтрШаблон("%1 %2", Выборка.НомерЗаявки, Выборка.Описание);
			
			Если МаркиОборудования.Найти(Выборка.Марка) = Неопределено Тогда
				МаркиОборудования.Добавить(Выборка.Марка);
			КонецЕсли;
			
			СуммаИтого 	= СуммаИтого + Выборка.Сумма;
			НомерПП 	= НомерПП + 1;
			
			Если Не ТабДок.ПроверитьВывод(СтрокаСПодвалом) Тогда			
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц(); 
				ТабДок.Вывести(ОбластьШапка);
				КоличествоСтраниц = КоличествоСтраниц + 1;
			КонецЕсли; 
			
			ТабДок.Вывести(ОбластьСтрока); 		
		КонецЦикла;
		
		ОбластьПодвал.Параметры.Валюта 				= ЭтотОбъект.Валюта;
		ОбластьПодвал.Параметры.СуммаИтого 			= Формат(СуммаИтого, "ЧДЦ=2");
		ОбластьПодвал.Параметры.МаркаОборудования 	= ВРег(СтрСоединить(МаркиОборудования, ","));
		ОбластьПодвал.Параметры.НомерАкта			= Формат(ДатаФормирования, "ДФ='dMMyy'");
		ОбластьПодвал.Параметры.ДатаАкта   			= Формат(ДатаФормирования, "ДФ='dd.MM.yyyy'");
	
		ТабДок.Вывести(ОбластьПодвал);		
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц(); 
	КонецЦикла;
	
	ТабДок.РазмерКолонтитулаСнизу		= 20;
	ТабДок.НижнийКолонтитул.Выводить 	= Истина;
	ТабДок.НижнийКолонтитул.ТекстСлева 	= СформироватьТекстКолонтитула();

	Возврат ТабДок;
	
КонецФункции

Функция СформироватьТабличныйДокументУпаковочныйЛист() Экспорт
	
	Макет = ПолучитьМакет("ПФ_MXL_УпаковочныйЛист");
	
	ОбластьЗаголовок	= Макет.ПолучитьОбласть("ОбластьЗаголовок");
	ОбластьШапка 		= Макет.ПолучитьОбласть("ОбластьШапка");
	ОбластьСтрока 		= Макет.ПолучитьОбласть("ОбластьСтрока");
	ОбластьПодвал 		= Макет.ПолучитьОбласть("ОбластьПодвал");

	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИспользуемоеИмяФайла = "Упаковочный лист"; 
	ТабДок.ПолеСверху 	= 7;
	ТабДок.ПолеСлева 	= 0;
	ТабДок.ПолеСправа 	= 0;
	ТабДок.ПолеСнизу 	= 20;
	ТабДок.АвтоМасштаб = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	#Область ТекстЗапроса
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЧ.НомерЗаявки КАК НомерЗаявки,
	|	ТЧ.ЗаявкаСсылка КАК ЗаявкаСсылка,
	|	ТЧ.Номенклатура КАК Номенклатура,
	|	ТЧ.Количество КАК Количество,
	|	ТЧ.КодТНВЭД КАК КодТНВЭД,
	|	ТЧ.ВесНетто КАК ВесНетто,
	|	ТЧ.Цена КАК Цена,
	|	ТЧ.Описание КАК Описание,
	|	ТЧ.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВТ_ТЧ
	|ИЗ
	|	&ТЧ КАК ТЧ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ТЧ.Описание КАК Описание,
	|	ВТ_ТЧ.КодТНВЭД КАК КодТНВЭД,
	|	ВТ_ТЧ.Количество КАК Количество,
	|	ВТ_ТЧ.Сумма КАК Сумма,
	|	ВТ_ТЧ.ВесНетто КАК ВесНетто,
	|	ВТ_ТЧ.НомерЗаявки КАК НомерЗаявки,
	|	ВТ_ТЧ.Цена КАК Цена,
	|	ЕСТЬNULL(ПриобретениеТоваровУслуг.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Получатель,
	|	ЕСТЬNULL(НоменклатураОборудования.Марка, """") КАК Марка
	|ИЗ
	|	ВТ_ТЧ КАК ВТ_ТЧ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.смартЗаявкаНаГарантийныйРемонт КАК смартЗаявкаНаГарантийныйРемонт
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
	|			ПО смартЗаявкаНаГарантийныйРемонт.ДокументПриобретения = ПриобретениеТоваровУслуг.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураОборудования
	|			ПО смартЗаявкаНаГарантийныйРемонт.Оборудование = НоменклатураОборудования.Ссылка
	|		ПО ВТ_ТЧ.ЗаявкаСсылка = смартЗаявкаНаГарантийныйРемонт.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерЗаявки
	|ИТОГИ ПО
	|	Получатель";
	#КонецОбласти
	
	Запрос.УстановитьПараметр("ТЧ",	ЗапчастиКОтправке.Выгрузить());
	
	РезультатЗапроса	= Запрос.Выполнить();	
	ВыборкаПолучатели	= РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ДатаФормирования	= ЭтотОбъект.Дата;
	
	Пока ВыборкаПолучатели.Следующий() Цикл 
				
		ОбластьЗаголовок.Параметры.Номер 		= Формат(ДатаФормирования, "ДФ='dMMyy'");
		
		Сведения 								= ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ВыборкаПолучатели.Получатель, ДатаФормирования);
        ОбластьЗаголовок.Параметры.Получатель 	= ?(ЗначениеЗаполнено(Сведения.ПолноеНаименование), Сведения.ПолноеНаименование, ВыборкаПолучатели.Получатель);
		ОбластьЗаголовок.Параметры.ФактическийАдресПолучателя	= Сведения.ФактическийАдрес; 
		ОбластьЗаголовок.Параметры.ТелефонПолучателя 			= Сведения.Телефоны;
        ОбластьЗаголовок.Параметры.КонтактноеЛицоПолучателя		= ВыборкаПолучатели.Получатель.смартОтветственныйЗаЭДО;
		
		ТабДок.Вывести(ОбластьЗаголовок); 
		ТабДок.Вывести(ОбластьШапка);
		
		СтрокаСПодвалом 	= Новый Массив; // Массив для проверки вывода 
		СтрокаСПодвалом.Добавить(ОбластьСтрока); 
		СтрокаСПодвалом.Добавить(ОбластьПодвал);
        
        МаркиОборудования	= Новый Массив;
		Выборка = ВыборкаПолучатели.Выбрать();
		
		Пока Выборка.Следующий() Цикл			
			Если МаркиОборудования.Найти(Выборка.Марка) = Неопределено Тогда
				МаркиОборудования.Добавить(Выборка.Марка);
			КонецЕсли; 						
		КонецЦикла;
		
		ОбластьСтрока.Параметры.НомерПП 	= 1;
		ОбластьСтрока.Параметры.Описание 	= СтрШаблон("Части режущих плоттеров т.м. %1 / Parts for cutting plotters %1", 
											ВРег(СтрСоединить(МаркиОборудования, ","))); 
		ТабДок.Вывести(ОбластьСтрока);

		ТабДок.Вывести(ОбластьПодвал);		
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц(); 
	КонецЦикла;
	
	ТабДок.РазмерКолонтитулаСнизу		= 20;
	ТабДок.НижнийКолонтитул.Выводить 	= Истина;
	ТабДок.НижнийКолонтитул.ТекстСлева 	= СформироватьТекстКолонтитула();

	Возврат ТабДок;
	
КонецФункции

Функция ПолучитьСоответствиеОбозначенияВалюты()
	Результат = Новый Соответствие();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Валюты.Ссылка КАК Ссылка,
	|	""$"" КАК Символ
	|ИЗ
	|	Справочник.Валюты КАК Валюты
	|ГДЕ
	|	Валюты.Код = ""840"" 
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Валюты.Ссылка,
	|	""€""
	|ИЗ
	|	Справочник.Валюты КАК Валюты
	|ГДЕ
	|	Валюты.Код = ""978"" 
    |
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Валюты.Ссылка,
	|	""¥""
	|ИЗ
	|	Справочник.Валюты КАК Валюты
	|ГДЕ
	|	Валюты.Код = ""156""
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Валюты.Ссылка,
	|	""₽""
	|ИЗ
	|	Справочник.Валюты КАК Валюты
	|ГДЕ
	|	Валюты.Код = ""643""
	|";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Ссылка, Выборка.Символ);
	КонецЦикла; // Пока Выборка.Следующий() Цикл
	Возврат Результат;
КонецФункции // ПолучитьСоответствиеОбозначенияВалюты

Функция СформироватьТекстКолонтитула()
	Отступ				= "                           ";
	ШрифтКолонтитула 	= Новый Шрифт("Times New Roman", 10, Ложь);
	ШрифтКолонтитулаПЖ 	= Новый Шрифт("Times New Roman", 10, Истина);
		
	Строка1 = Новый ФорматированнаяСтрока("Smart-T LLC", 		ШрифтКолонтитулаПЖ);
	Строка2 = Новый ФорматированнаяСтрока("TIN: ",				ШрифтКолонтитулаПЖ);
	Строка3 = Новый ФорматированнаяСтрока("7709461879",			ШрифтКолонтитула);
	Строка4 = Новый ФорматированнаяСтрока("Contact Person: ",	ШрифтКолонтитулаПЖ);
	Строка5 = Новый ФорматированнаяСтрока("Strekalov Sergey, +7 (495) 663-9111, strekalov@smart-t.ru", 
																ШрифтКолонтитула);
	
	Возврат Новый ФорматированнаяСтрока(Отступ, Строка1, Символы.ПС, 
										Отступ, Строка2, Строка3, Символы.ПС, 
										Отступ, Строка4, Строка5);
КонецФункции // СформироватьТекстКолонтитула
//-- #3978 смарт: Тимофеева 11.08.2025

#КонецОбласти

#КонецЕсли
